package com.amorphteam.ketub.utility

import com.amorphteam.ketub.model.*

class TempData {
    companion object {

        val indexItems = listOf(
            TocGroupItem(
                1, "إشكالية اللغة في الخطاب الديني", "نصوص معاصرة",
                listOf(
                    TocFirstChildItem(
                        1, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        2, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        3, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    )
                )
            ),
            TocGroupItem(
                2,
                "مباني فهم النصّ / في الفكر الأصوليّ للسيّد محمّد باقر الصدر",
                "الاجتهاد والتجديد",
                listOf(
                    TocFirstChildItem(
                        1, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        2, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    )
                )
            ),
            TocGroupItem(
                3,
                "قاعدة نفي خلوّ الوقائع من الحكم الشرعي وأثرها في علم أصول الفقه ـ القسم الثاني",
                "نصوص معاصرة",
                listOf(
                    TocFirstChildItem(
                        1, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        2, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        3, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        4, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    )
                )
            )
        )
    }
}