package com.amorphteam.ketub.utility

import com.amorphteam.ketub.model.ReferenceModel
import com.amorphteam.ketub.model.TocFirstChildItem
import com.amorphteam.ketub.model.TocGroupItem
import com.amorphteam.ketub.model.TocSecondChildItem
import com.amorphteam.ketub.ui.search.model.SearchModel

class TempData {
    companion object {

        var searchResult = arrayListOf(
            SearchModel(1, 29, "نصوص معاصرة", "إشكالية اللغة في الخطاب الديني "),
            SearchModel(
                2,
                13,
                "الاجتهاد والتجديد",
                "قاعدة نفي خلوّ الوقائع من الحكم الشرعي وأثرها في علم أصول الفقه ـ القسم الثاني"
            ),
            SearchModel(3, 43, "نصوص معاصرة", "إله العرفان وإله الفلسفة / اختلافاتٌ جوهريّة"),
            SearchModel(4, 75, "الاجتهاد والتجديد", "الوَحْي الإلهيّ عند الفارابي"),
            SearchModel(5, 66, "نصوص معاصرة", "إله العرفان وإله الفلسفة / اختلافاتٌ جوهريّة"),
            SearchModel(6, 103, "الاجتهاد والتجديد", "الوَحْي الإلهيّ عند الفارابي"),
            SearchModel(
                7,
                547,
                "نصوص معاصرة",
                "مباني فهم النصّ / في الفكر الأصوليّ للسيّد محمّد باقر الصدر"
            )
        )

        var bookMarkArray = arrayListOf(
            ReferenceModel(111, "إشكالية اللغة في الخطاب الديني", "نصوص معاصرة", "", 1, "", 3F),
            ReferenceModel(
                11111,
                "إشكالية اللغة في الخطاب الديني", "نصوص معاصرة", "", 1, "", 3F),
            ReferenceModel(
                111111,
                "إشكالية اللغة في الخطاب الديني", "نصوص معاصرة", "", 1, "", 3F),
            ReferenceModel(111111111, "إشكالية اللغة في الخطاب الديني", "نصوص معاصرة", "", 1, "", 3F),
            ReferenceModel(1111221111, "إشكالية اللغة في الخطاب الديني", "نصوص معاصرة", "", 1, "", 3F),
            ReferenceModel(645, "إشكالية اللغة في الخطاب الديني", "نصوص معاصرة", "", 1, "", 3F),
            ReferenceModel(47, "إشكالية اللغة في الخطاب الديني", "نصوص معاصرة", "", 1, "", 3F),
            ReferenceModel(58, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", "", 1, "", 3F),
            ReferenceModel(69, "إشكالية اللغة في الخطاب الديني", "نصوص معاصرة", "", 1, "", 3F),
            )

        val indexItems = listOf(
            TocGroupItem(
                1, "إشكالية اللغة في الخطاب الديني", "نصوص معاصرة",
                listOf(
                    TocFirstChildItem(
                        1, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        2, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        3, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    )
                )
            ),
            TocGroupItem(
                2,
                "مباني فهم النصّ / في الفكر الأصوليّ للسيّد محمّد باقر الصدر",
                "الاجتهاد والتجديد",
                listOf(
                    TocFirstChildItem(
                        1, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        2, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    )
                )
            ),
            TocGroupItem(
                3,
                "قاعدة نفي خلوّ الوقائع من الحكم الشرعي وأثرها في علم أصول الفقه ـ القسم الثاني",
                "نصوص معاصرة",
                listOf(
                    TocFirstChildItem(
                        1, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        2, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        3, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    ),
                    TocFirstChildItem(
                        4, "إشكالية اللغة في الخطاب الديني", "الاجتهاد والتجديد", listOf(
                            TocSecondChildItem(
                                1,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                2,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            ),
                            TocSecondChildItem(
                                3,
                                "إشكالية اللغة في الخطاب الديني",
                                "الاجتهاد والتجديد"
                            )
                        )
                    )
                )
            )
        )
    }
}